Examinator/src/Documents/НовостьСУО/НовостьСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НовостьСУО</name>
  <registerRecords>InformationRegister.НовостиСУО</registerRecords>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Выделить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрепить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяРассылка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/НовостиСУО/НовостиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НовостиСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Выделить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрепить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/НовостьСУО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;			
	
	ДатаИзменения = ТекущаяДата();
	
	Если Ссылка.Пустая() И НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.НовостиСУО.Записывать = Истина;
	
	Если Получатели.Количество() > 0 Тогда
		
		Для каждого Строка Из Получатели Цикл
		
			Движение = Движения.НовостиСУО.Добавить();
			
			Движение.Дата = ДатаПубликации;
			Движение.Пользователь = Строка.Пользователь;
			Движение.Заголовок = Заголовок;
			Движение.Выделить = Выделить;
			Движение.Закрепить = Закрепить;
		
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Автор) И Получатели.Найти(Автор, "Пользователь") = Неопределено Тогда
		
			Движение = Движения.НовостиСУО.Добавить();
			
			Движение.Дата = ДатаПубликации;
			Движение.Пользователь = Автор;
			Движение.Заголовок = Заголовок;
			Движение.Выделить = Выделить;
			Движение.Закрепить = Закрепить;
			
		КонецЕсли;
		
		Если АвтоматическаяРассылка Тогда
			УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ЭтотОбъект, Получатели);
		КонецЕсли;
		
	Иначе
		
		Движение = Движения.НовостиСУО.Добавить();
		
		Движение.Дата = ДатаПубликации;
		Движение.Заголовок = Заголовок;
		Движение.Выделить = Выделить;
		Движение.Закрепить = Закрепить;
		
		Если АвтоматическаяРассылка Тогда
			УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ЭтотОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
	Движения.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ИдентификаторОбъектаКопирования = ОбъектКопирования.Ссылка.УникальныйИдентификатор();
КонецПроцедуры

#КонецОбласти


#КонецЕсли
